Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS60/atdf/PIC32CM1216LS60100.atdf
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="UNDERRUN0" caption="Underrun Interrupt Enable for DAC 0" mask="0x1"/>
          <bitfield name="UNDERRUN1" caption="Underrun Interrupt Enable for DAC 1" mask="0x2"/>
          <bitfield name="EMPTY0" caption="Data Buffer 0 Empty Interrupt Enable" mask="0x4"/>
          <bitfield name="EMPTY1" caption="Data Buffer 1 Empty Interrupt Enable" mask="0x8"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="UNDERRUN0" caption="DAC 0 Underrun" mask="0x1"/>
          <bitfield name="UNDERRUN1" caption="DAC 1 Underrun" mask="0x2"/>
          <bitfield name="EMPTY0" caption="Data Buffer 0 Empty" mask="0x4"/>
          <bitfield name="EMPTY1" caption="Data Buffer 1 Empty" mask="0x8"/>
        </register>
        <register name="STATUS" offset="0x7" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY0" caption="DAC 0 Startup Ready" mask="0x1"/>
          <bitfield name="READY1" caption="DAC 1 Startup Ready" mask="0x2"/>
          <bitfield name="EOC0" caption="DAC 0 End of Conversion" mask="0x4"/>
          <bitfield name="EOC1" caption="DAC 1 End of Conversion" mask="0x8"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="DAC Enable Status" mask="0x2"/>
          <bitfield name="DATA0" caption="Data DAC 0" mask="0x4"/>
          <bitfield name="DATA1" caption="Data DAC 1" mask="0x8"/>
          <bitfield name="DATABUF0" caption="Data Buffer DAC 0" mask="0x10"/>
          <bitfield name="DATABUF1" caption="Data Buffer DAC 1" mask="0x20"/>
        </register>
        <register name="DACCTRL" offset="0xC" rw="RW" size="2" count="2" initval="0x0000" caption="DAC n Control">
          <bitfield name="LEFTADJ" caption="Left Adjusted Data" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable DAC0" mask="0x2"/>
          <bitfield name="CCTRL" caption="Current Control" mask="0xC" values="DAC_DACCTRL__CCTRL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="DITHER" caption="Dithering Mode" mask="0x80"/>
          <bitfield name="REFRESH" caption="Refresh period" mask="0xF00" values="DAC_DACCTRL__REFRESH"/>
        </register>
        <register name="DATA" offset="0x10" rw="W" access="WSYNC" size="2" count="2" initval="0x0000" caption="DAC n Data">
          <bitfield name="DATA" caption="DAC0 Data" mask="0xFFFF"/>
        </register>
        <register name="DATABUF" offset="0x14" rw="W" access="WSYNC" size="2" count="2" initval="0x0000" caption="DAC n Data Buffer">
          <bitfield name="DATABUF" caption="DAC0 Data Buffer" mask="0xFFFF"/>
        </register>
        <register name="DBGCTRL" offset="0x18" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="DAC_DACCTRL__REFRESH">
        <value name="REFRESH_0" caption="Do not Refresh" value="0"/>
        <value name="REFRESH_2" caption="Refresh every 60US" value="2"/>
        <value name="REFRESH_3" caption="Refresh every 90US" value="3"/>
        <value name="REFRESH_4" caption="Refresh every 120US" value="4"/>
        <value name="REFRESH_5" caption="Refresh every 150US" value="5"/>
        <value name="REFRESH_6" caption="Refresh every 180US" value="6"/>
        <value name="REFRESH_7" caption="Refresh every 210US" value="7"/>
        <value name="REFRESH_8" caption="Refresh every 240US" value="8"/>
        <value name="REFRESH_9" caption="Refresh every 270US" value="9"/>
        <value name="REFRESH_10" caption="Refresh every 300US" value="10"/>
        <value name="REFRESH_11" caption="Refresh every 330US" value="11"/>
        <value name="REFRESH_12" caption="Refresh every 360US" value="12"/>
        <value name="REFRESH_13" caption="Refresh every 390US" value="13"/>
        <value name="REFRESH_14" caption="Refresh every 420US" value="14"/>
        <value name="REFRESH_15" caption="Refresh every 450US" value="15"/>
      </value-group>
      <value-group name="DAC_CTRLB__REFSEL">
        <value name="VREFAU" caption="Unbuffered External Voltage Reference (not buffered in DAC, direct connection)" value="0"/>
        <value name="VDDANA" caption="Analog Voltage Supply" value="1"/>
        <value name="VREFAB" caption="Buffered External Voltage Reference (buffered in DAC)" value="2"/>
        <value name="INTREF" caption="Internal Voltage Reference" value="3"/>
      </value-group>
      <value-group name="DAC_DACCTRL__CCTRL">
        <value name="CC100K" caption="GCLK_DAC &lt;= 1.2MHz (100kSPS)" value="0x0"/>
        <value name="CC1M" caption="1.2MHz &lt; GCLK_DAC &lt;= 6MHz (500kSPS)" value="0x1"/>
        <value name="CC12M" caption="6MHz &lt; GCLK_DAC &lt;= 12MHz (1MSPS)" value="0x2"/>
      </value-group>
    </module>
    <module name="DIB" version="1.0.0" caption="Debug Identification Block">
      <register-group name="DIB" caption="Debug Identification Block">
        <register name="DLAR" offset="0x0" rw="W" size="4" access-size="4" caption="SCS Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="DIB_DLAR__KEY"/>
        </register>
        <register name="DLSR" offset="0x4" rw="R" size="4" access-size="4" caption="SCS Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
